name = input("- Как тебя зовут?\n- ")

print("Привет,", name, "!")


# a = 7
# print('Периметр квадрата', a * 4)
# print('Площадь квадрата', a ** 2)

# print(5 ** 2)

# print(101 % 10)

# print(111 // 19)


# Даны числа 8 и 18. Найди и выведи их среднее геометрическое.
# Формула среднего геометрического: G = sqrt{a * b}
# sqrt - квадратный корень

# n1, n2 = 8, 18
# G = (n1 * n2) ** (1/2)

# print(G)


# Катеты прямоугольного треугольника равны 5 и 12. 
# Найди и выведи гипотенузу прямоугольного треугольника.

# k1, k2 = 5, 12
# H = (5**2 + 12**2) ** (1/2)

# print(H)

