side = input("Введите сторону квадрата")

# Преобразуем ввод в целое число:
side = int(side)

p = side * 4
s = side * side

print("Периметр:", p)
print("Площадь:", s)



# Дано двузначное число a. Найди и выведи количество десятков в нем.

a = 75

print(a // 10)


# Дано двузначное число a. Найди и выведи его последнюю цифру.

b = 56

print(b % 10)
