
# a = input("Число a: ")

# b = input("Число b: ")

# a = int(float(a))

# b = int(float(b))

# print("Сумма целых частей:")
# print(a + b)







# print("* Программа для расчета периметра и площади прямоугольника *")

# a = input("Введите ширину:\n")

# b = input("Введите длину:\n")

# a = int(a)

# b = int(b)

# p = (b + a) * 2
# s = a * b

# print("Периметр:", p)
# print("Площадь:", s)














# side = input("Введите сторону квадрата\n")

# # Преобразуем ввод в целое число:
# side = int(side)

# p = side * 4
# s = side * side

# print("Периметр:", p)
# print("Площадь:", s)



# Дано двузначное число a. Найди и выведи количество десятков в нем.

# a = 75

# print(a // 10)


# Дано двузначное число a. Найди и выведи его последнюю цифру.

# b = 56

# print(b % 10)


# Дано трехзначное число a. Найди и выведи сумму его цифр.
# Единицы + десятки + сотни

# a = input("Введите трехзначное число:\n")

# a = int(a)

# # 432
# result = (a % 10) + (a // 10 % 10) + (a // 100)


# print(result)



