# Программа получает на вход дробное число a.
# Найди и выведи первую цифру после десятичной точки.


a1 = 35.97
a2 = 7.45
result = int((a1 * 10) % 10)
print(result)
