# Дано целое трёхзначное число a. Выведи количество чётных цифр в данном числе


# a = 268

# a = str(a)

# a1 = int(a[0])
# a2 = int(a[1])
# a3 = int(a[2])

# n = 0

# print(a1, a2, a3)

# if a1 % 2 == 0:
#     n += 1
# if a2 % 2 == 0:
#     n += 1
# if a3 % 2 == 0:
#     n += 1

# print("Количество четный чисел:", n)


# Даны 4 числа a, b, c и d. Одно из них отлично от оставшихся, равных друг другу. Необходимо вывести данное число.

# a, b, c, d = 5, 1, 1, 1

# print(a, b, c, d)


# if a != b and a != c and a != d:
#     print(a)

# if b != a and b != c and b != d:
#     print(b)

# if c != a and c != b and c != d:
#     print(c)

# if d != a and d != b and d != c:
#     print(c)


# Даны две различные клетки шахматного поля, каждая из которых задаётся двумя числами, — координата по xx, координата по yy. Выведи 11, если шахматный король сможет перейти с первой клетки на вторую одним ходом, иначе выведи 00.


# x1 = 2
# y1 = 2

# x2 = 3
# y2 = 4


# if (abs(x1 - x2) == 1 or x1 == x2) and (abs(y1 - y2) == 1 or y1 == y2):
#     print(1)
# else:
#     print(0)



