# Дано натуральное число N. Вычисли:
# 1+2+3+...+N

n = 9

sum = 0

for x in range(1, n+1):
    sum = sum + x
    print('Число:', x, '  Сумма:', sum)


print("---------------------------")
print("Итог:", sum)


# Дано натуральное число N. Вычисли:
# 1/2/3/.../N.


# n = 7

# res = 1

# for i in range(2, n+1):
#     res = res / i

#     print("Число", i, "  Результат деления:", res)


# Дано натуральное число N. Вычисли:

# 1 ^ 1 + 2 ^ 2 + 3 ^ 3 + ... + N ^ N

# n = 7

# res = 0

# for i in range(1, n+1):
#     res = res + i ** i

#     print("Число", i, "  Результат:", res)
