
x = 0

while x < 10:
    print(x ** 2)
    x = x + 1


# Дано натуральное число N. Выведи все степени числа 2, не превосходящие



# n = 20
# a = 0

# while 2**a < n:
#     print(2**a)
#     a = a + 1



# WHILE
# x = 5

# while x**2 < 1000:
#     x = x + 5
#     # Пропустить значение
#     if x**2 == 100:
#         # Переходим к следующей итерации
#         continue

#     print(x, x**2)
#     if x**2 == 625:
#         print("Число найдено!")
#         break
    

# else:
#     print("Число не найдено")


# # После цикла
# print("Цикл закончен!")