

'''
FizzBuz. Напишите приложение, которое проходит по целым числам от 1 до 50. 
Если число делится без остатка на 3, то вместо этого числа выведите «Fizz». 
Если число делится без остатка на 5, выведите «Buzz». 
Если число делится без остатка и на 3, и на 5, то выведите «FizzBuzz».

'''



# Паттерны
# https://www.tutorialstonight.com/python/pattern-program-in-python 
'''
Пользователь вводит число. Вывести рамку заданной высоты и ширины. Пример:


side: 5

#####
#   #
#   #
#   #
#####
'''

'''
Пользователь вводит количество ступенек, приложение выводит лестницу:

Steps: 5

     #
    ##
   ###
  ####
 #####

'''



'''


Пользователь вводит натуральное число n, 
вывести пирамиду высотой n

    *
   ***
  *****
 *******
*********










    *
   * *
  *   *
 *     *
*********



    *
   ***
  *****
 *******
*********
 *******
  *****
   ***
    *




*********
 *******
  *****
   ***
    *
   ***
  *****
 *******
*********


Написать программу, которая выводит пирамиду из чисел от 1 до 9

    1
   123
  12345
 1234567
123456789










123456789
 1234567
  12345
   123
    1

'''