'''
СР 1

Задачи на цикл FOR

1. 
С экрана вводится натуральное число n. 
Выведите квадраты всех чисел от 1 до n.

!!! Вывод идёт в два столбца, на каждой строке число и его квадрат.
!!! Используйте форматированный вывод.


2. 
С экрана вводится натуральное число n. 
Выведите кубы всех чисел от 1 до n.

!!! Вывод идёт в два столбца, на каждой строке число и его куб.
!!! Используйте форматированный вывод.

Например, при n=5 должно быть выведено:
1     1
2     8
3    27
4    64
5   125


3.
С экрана вводятся два целых числа a и b. 
Выведите все числа от a до b включительно:
в порядке возрастания, если a < b, 
или в порядке убывания в противном случае. 

!!! Все числа должны быть выведены на одной строке через пробелы. 

4.
Для каждого ТРЁХЗНАЧНОГО числа, кратного 5 (вида abc) 
проделайте последовательно следующие операции:
1) Найдите его цифры (a, b, c).
2) Найдите квадраты его цифр (назовите их akv, bkv, ckv).
3) Выведите числа abc, a, b, c, akv, bkv, ckv на экран. 
    Эти СЕМЬ чисел должны быть выведены на одной строке через пробелы. 


5.
С экрана вводится натуральное число n > 20 (об этом надо 
просто написать подсказку). 
Для каждого числа x в диапазоне от 10 до n проделайте 
последовательно следующие операции:
1) Если число нечетное, то отнимите от него 1,
    если четное, то оставьте его без изменений.
    Назовите это число x1.
2) Получившеся число x1 разделите на 2, назовите его x2.
3) Если x2 четное, то прибавьте к нему 1,
    если нечетное, то оставьте его без изменений.
    Назовите это число x3.
4) Выведите числа x, x1, x2, x3 на экран. Эти ЧЕТЫРЕ числа
    должны быть выведены на одной строке через пробелы. 


'''