'''
СР 1

Задачи на цикл FOR

1. 
С экрана вводится натуральное число n. 
Выведите квадраты всех чисел от 1 до n.

!!! Вывод идёт в два столбца, на каждой строке число и его квадрат.
!!! Используйте форматированный вывод.


2. 
С экрана вводится натуральное число n. 
Выведите кубы всех чисел от 1 до n.

!!! Вывод идёт в два столбца, на каждой строке число и его куб.
!!! Используйте форматированный вывод.

Например, при n=5 должно быть выведено:
1     1
2     8
3    27
4    64
5   125


3.
С экрана вводятся два целых числа a и b. 
Выведите все числа от a до b включительно:
в порядке возрастания, если a < b, 
или в порядке убывания в противном случае. 

!!! Все числа должны быть выведены на одной строке через пробелы. 

4.
Для каждого ТРЁХЗНАЧНОГО числа, кратного 5 (вида abc) 
проделайте последовательно следующие операции:
1) Найдите его цифры (a, b, c).
2) Найдите квадраты его цифр (назовите их akv, bkv, ckv).
3) Выведите числа abc, a, b, c, akv, bkv, ckv на экран. 
    Эти СЕМЬ чисел должны быть выведены на одной строке через пробелы. 


5.
С экрана вводится натуральное число n > 20 (об этом надо 
просто написать подсказку). 
Для каждого числа x в диапазоне от 10 до n проделайте 
последовательно следующие операции:
1) Если число нечетное, то отнимите от него 1,
    если четное, то оставьте его без изменений.
    Назовите это число x1.
2) Получившеся число x1 разделите на 2, назовите его x2.
3) Если x2 четное, то прибавьте к нему 1,
    если нечетное, то оставьте его без изменений.
    Назовите это число x3.
4) Выведите числа x, x1, x2, x3 на экран. Эти ЧЕТЫРЕ числа
    должны быть выведены на одной строке через пробелы. 


'''


'''
СР 2

Задачи на цикл FOR


1. 
Выведите все четырехзначные числа, обладающие следующими особенностями:
    если считать, что это число как бы состоит из двух двузначных чисел,
    то второе получается из первого перестановкой цифр,
    а разность этих двузначных чисел равна сумме цифр каждого из них.

!!! Все числа должны быть выведены на одной строке через пробелы. 
Затем на следующей строке выведите количество найденных чисел.

Замечание: используйте целочисленную арифметику (НЕ СТРОКИ).


2.
Сначала с экрана вводится произвольная цифра.
Выведите все трёхзначные числа, в записи которых содержатся
ровно две таких цифры.
!!! Все числа должны быть выведены на одной строке через пробелы. 
Затем на следующей строке выведите количество найденных чисел.

Замечание: используйте целочисленную арифметику (НЕ СТРОКИ). 



3.
Выведите все двузначные числа, квадраты которых являются 
трехзначными числами. Найденные числа выведите на экран 
в 2 столбца:
    Число    Его квадрат

!!! Вывод идёт в два столбца, на каждой строке число и его квадрат.
!!! Используйте форматированный вывод.
Затем на отдельной строке выведите количество получившихся чисел.


4.
С экрана вводятся 2 четырёхзначных числа x1 и x2 (x1 < x2).
Выведите все четырёхзначные числа x, расположенные в 
диапазоне от x1 до x2 (x1 <= x <= x2), у которых четность цифр,
стоящих рядом, различна.
!!! Числа должны быть выведены по 20 штук на каждой строке через пробелы,
!!! затем идёт переход на следующую строку.
!!! Количество чисел в последней строке может оказаться меньше 20.
Затем выведите сумму этих чисел. Также выведите их количество


5. 

С экрана вводятся 2 трёхзначных числа x1 и x2 (x1 < x2).
Выведите все трёхзначные числа x, расположенные в 
диапазоне от x1 до x2 (x1 <= x <= x2), в записи квадратов которых 
две последние цифры отличаются на число d.
Число d также вводится с экрана (0 <=d <= 9).
Затем выведите сумму этих чисел. Также выведите их количество.
!!! ДО вывода указанных суммы и количества выведите сами эти
числа и их квадраты. Вывод в 2 столбца, форматированный. 
 
'''