

'''
CР 1

1. Напишите программу, которая запрашивает у пользователя число и находит 
сумму всех положительных чисел, кратных 7 до этого числа

2. Напишите программу, которая запрашивает у пользователя число и находит 
сумму всех положительных чисел, кратных 11 и 2 до этого числа

3. Напишите программу, которая запрашивает у пользователя число и находит 
сумму всех положительных чисел, кратных 3 или 5, до этого числа.

4. Напишите программу, которая запрашивает у пользователя  два числа А и B
вывести все числа кратные 5 от A до B включительно.
Посчитать сумму этих чисел.

5. С клавиатуры вводится последовательность целых чисел, оканчивающаяся числом 0,
который служит признаком конца ввода последовательности.
Вычислить сумму этих чисел


'''

'''
CР 2


1.
С экрана вводится натуральное число.
Выведите все цифры числа и отдельно самую ЛЕВУЮ цифру этого числа.
Также выведите количество его цифр.
Вывод цифр идёт СПРАВА НАЛЕВО, на одной строке и через Пробелы.

2.
С экрана вводится натуральное число N. Определить его наименьший делитель d,
отличный от 1 и его самого. Если такой делитель найден, то надо вывести его
значение на экран. Если же нет, то надо вывести об этом соответствующее сообщение.

3.
Выведите N первых натуральных чисел, у которых крайние цифры одинаковые.
Такие числа назовём ХОРОШИМИ.
Числа вывести на ОДНОЙ строке, разделитель ПРОБЕЛ.

4.
Вывести заданное количество k случайных целых чисел в диапазоне от a до b.
Числа k, a и b вводятся с экрана.
Вывод - по 10 чисел на одной строке через пробел.

5.
Написать программу, выводящую случайные целые числа в диапазоне от a до b
до тех пор, пока не выпадет число, равное одному из чисел - a или b.
Числа a и b вводятся с экрана.


'''


'''
СР 3 



1. 
С клавиатуры вводится последовательность целых чисел, оканчивающаяся числом 0,
который служит признаком конца ввода последовательности.
Вычислить сумму этих чисел

2.
С клавиатуры вводится последовательность целых чисел, знаком окончания последовательности
является ввод пустой строки
Вычислить среднее арифметическое для этих чисел.

3.
С клавиатуры вводится последовательность целых чисел, знаком окончания последовательности
является ввод пустой строки
Вычислить отдельно сумму четных и нечетных чисел.

4.
С клавиатуры вводится последовательность целых чисел, оканчивающаяся числом 0,
который служит признаком конца ввода последовательности. 
Найти наибольшее значение.

'''
