'''
1.
С экрана вводится натуральное число.
Выведите все цифры числа и отдельно самую ЛЕВУЮ цифру этого числа.
Также выведите количество его цифр.
Вывод цифр идёт СПРАВА НАЛЕВО, на одной строке и через Пробелы.

2.
С экрана вводится натуральное число N. Определить его наименьший делитель d,
отличный от 1 и его самого. Если такой делитель найден, то надо вывести его
значение на экран. Если же нет, то надо вывести об этом соответствующее сообщение.

3.
Выведите N первых натуральных чисел, у которых крайние цифры одинаковые.
Такие числа назовём ХОРОШИМИ.
Числа вывести на ОДНОЙ строке, разделитель ПРОБЕЛ.

4.
Вывести заданное количество k случайных целых чисел в диапазоне от a до b.
Числа k, a и b вводятся с экрана.
Вывод - по 10 чисел на одной строке через пробел.

5.
Написать программу, выводящую случайные целые числа в диапазоне от a до b
до тех пор, пока не выпадет число, равное одному из чисел - a или b.
Числа a и b вводятся с экрана.

'''