# Задача 1
# Гласные и согласные
# Напиши программу, которая считает количество гласных 
# и согласных букв в слове


# Задача 2
# Какого цвета клетка?
# Пользователь вводи координату клетки шахматной доски, например a5
# Необходимо определить, какого цвета эта клетка.


# Задача 3
# Напишите программу, которая будет запрашивать у пользователя год
# рождения и выводить ассоциированное с ним название животного по
# китайскому календарю.


# Задача 4
# Написать программу для подсчета
# среднего значения всех введенных пользователем чисел. Индикатором
# окончания ввода будет служить ввод пустой строки.


# Задача 5
# Удалить из списка чисел все элементы, которые меньшие среднего арифметического


# Задача 6
# Игра FizzBuzz
# Выведите числа от 1 до 100, с условием, что если число делится 
# без остатка на 3, нужно вывести вместо числа Fizz, если
# делится без остатка на 5, то нужно вывести Buzz,
# если и на 3 и на 5 - вывести FizzBuzz

