# Пример множества (set)
# Неупорядоченная последовательность уникальных значений 

my_set = {67, 67, 67, 12, 12, 34, 54, 56, 76, 12}

print(my_set)













nums = [2, 3, 2, 2, 2, 99, 0, 150, 3245, 235]
# функция set - получаем множество из списка
# Вывести из списка только уникальные значения
print(sorted(set(nums)))
