
x = 0

while x < 10:
    print(x ** 2)
    x = x + 1


# Дано натуральное число N. Выведи все степени числа 2, не превосходящие



# n = 20
# a = 0

# while 2**a < n:
#     print(2**a)
#     a = a + 1



# WHILE
# x = 5


# Цикл WHILE

# Вывести все квадраты натуральных чисел, которые меньше 1000

# x = 0

# while x**2 < 1000:

#     # Пропускаем значения по условию
#     if x**2 % 100 == 0:
#         # Увеличиваем счетчик, чтобы не попасть в бесконечный цикл
#         # print('Пропущено', x**2)
#         x += 1
#         continue

#     # Вывод значения
#     print(x, x**2)

#     if x**2 == 226:
#         print("Число найдено")
#         break

#     x += 1

# else:
#     print("Цикл выполнен полностью. Число НЕ найдено")
